import * as React from 'react';

import Layout from '@/components/layout/Layout';
import Seo from '@/components/Seo';

export default function HomePage() {
  return (
    <Layout title={<>关于决心</>}>
      <Seo/>
      <div className="textbox">
        <p>
        {/* Do not deceive yourself, rash worker, as if one time can make up for another. For the day is not sufficient to repay in full its own debt to the Lord. （圣攀梯 6:23） */}
        </p>
        
        <p>
        最近沉思《神圣攀登的阶梯》的时候，突然觉得自己其实连第一步「放弃世界」都攀不上去。
        似乎对于平信徒来说，时刻记忆着这个世界毫无价值，把这世界的谎言全部看穿，并不总是那么容易。
        </p>

        <p>
        尤其是程序员、设计师这种有诱惑力的职业，想要切断对这个世界的激情，只能不停地告诉自己：自己所想的、所做的没有任何价值；不停地粉碎自己的妄想，承认真正的理想和美永远无法在这个世界抵达。
        要不然就会被魔鬼被那无比美妙的谎言所欺骗，回过头来便为时已晚。
        </p>

        <p>
        我是个永远的傻瓜，我一辈子已经被这世界的激情欺骗了无数次，即便是认识到其本质怕也要在很长一段时间内被继续欺骗下去。
        夹在两个世界中多么痛苦，我已经接近枯死，连向上帝不停地乞求都变成了一件困难的事。
        </p>
        
        <p>
        但我多少还有上帝的几分慈爱，我愿始终不渝地为祂奋斗。
        战胜智力上的敌人并没有什么奇技淫巧，只能通过反复地祈祷来坚定决心，坚定那与敌人苦战至死的理由，不停地铭记死亡和世界的真实。
        要不停地去计划，去思想那些自己今天将要做的事情，以免因准备不充分而沦为魔鬼的奴隶。
        要不停地把自己的心智从世界抽离出来，不止息的祈祷（帖前 5:17），以防在这个世界混乱的工作中遗忘了上帝。
        更不要相信有什么保证（圣攀梯 5:34），因忽略祷告的人随时都有可能被上帝抛弃。
        </p>

        <h2>关于如何制定计划</h2>

        <p>
          计划绝不是发誓，不要去强求任何东西，不要觉得自己一定能做到。也不要去试图计划地上的东西，以免因无法实现而痛苦。要去乞求自己脱离罪恶，得到上帝的怜悯。
        </p>

        <p>
          一定要划定每天的作息时间，并时常记忆，要因打破了规律的作息而痛苦。睡眠是一个极为难缠的敌人（圣攀梯 19:3），因此要拿出为那个世界而死的意志来与睡眠战斗，用极致的谦卑和牺牲精神回绝所有的欺骗。每天晚上「死亡」前都要仔细检查自己的心灵，保证自己心中对起床的「复活」有充分的期待和坚持。
        </p>

        <p>
          一定不要因工作而误了祈祷，相反，要为了工作而祈祷，把祈祷的重要性置于工作至上，并为之疯狂：工作的每小时都要抽出一定的时间祷告；
          更要好好利用吃饭的机会，规划吃饭的时间在吃饭前及时把心智从工作中抽出来转向上帝，并在吃饭前后坚持那样去做；
          也不能忘记了工作/学习前后的祷告词，尽量在工作中保持对上帝的敬意。
        </p>

        <p>
          不要因计划失败而心灰意冷，相反要认识到自己处境的艰难并用泪水努力悔改。因为这世界上对上帝的热情从来就没有极限，人总需要在一次一次的失败中突破对自己设置的限制。
        </p>




      </div>
    </Layout>
  );
}
